# vsoGetUseLyrCutPlane

## Description
Indicates whether an object is observing the layer cut plane

```pascal
PROCEDURE vsoGetUseLyrCutPlane(usingLyrCutPLane : BOOLEAN);
```

```python
def vs.vsoGetUseLyrCutPlane(usingLyrCutPLane):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|usingLyrCutPLane|BOOLEAN|   |

## Version
Availability: from Vectorworks 2017

## Category
* Object Events